return {
  "folke/snacks.nvim",
  opts = {
    dashboard = {
      preset = {
        header = [[
██╗      ██████╗ ███╗   ██╗███████╗██╗   ██╗██╗  ██╗   ██╗
██║     ██╔═████╗████╗  ██║██╔════╝╚██╗ ██╔╝██║  ╚██╗ ██╔╝
██║     ██║██╔██║██╔██╗ ██║█████╗   ╚████╔╝ ██║   ╚████╔╝
██║     ████╔╝██║██║╚██╗██║██╔══╝    ╚██╔╝  ██║    ╚██╔╝
███████╗╚██████╔╝██║ ╚████║███████╗   ██║   ███████╗██║
╚══════╝ ╚═════╝ ╚═╝  ╚═══╝╚══════╝   ╚═╝   ╚══════╝╚═╝

██╗      ██████╗ ██╗   ██╗██████╗
██║     ██╔═████╗██║   ██║╚════██╗
██║     ██║██╔██║██║   ██║ █████╔╝
██║     ████╔╝██║╚██╗ ██╔╝ ╚═══██╗
███████╗╚██████╔╝ ╚████╔╝ ██████╔╝
╚══════╝ ╚═════╝   ╚═══╝  ╚═════╝
        ]],
        keys = {
          { key = "n", action = "<Leader>n",  icon = "📄", desc = "新建文件" },
          { key = "f", action = "<Leader>ff", icon = "🔍", desc = "查找文件" },
          { key = "o", action = "<Leader>fo", icon = "📂", desc = "最近文件" },
          { key = "w", action = "<Leader>fw", icon = "📝", desc = "查找词语" },
          { key = "'", action = "<Leader>f'", icon = "🔖", desc = "书签" },
          { key = "s", action = "<Leader>Sl", icon = "🔄", desc = "上次会话" },
        },
      },
      sections = {
        { section = "header", padding = 3 },
        { section = "keys", gap = 1, padding = 2 },
      },
    },
  },
}
